## Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

## Step 2. Create the DataFrame with the following values:

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

## Step 3. Assign it to a variable.
### Don't forget to name each column

In [4]:
military_data = pd.DataFrame(raw_data, columns = raw_data.keys())

## Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [6]:
military_data[military_data['regiment'] == 'Nighthawks'].preTestScore.mean()

15.25

## Step 5. Present general statistics by company

In [9]:
military_data.groupby('company').describe().stack()

               preTestScore  postTestScore
company
1st     count      6.000000       6.000000
        mean       6.666667      57.666667
        std        8.524475      27.485754
        min        2.000000      25.000000
        25%        3.000000      34.250000
        50%        3.500000      66.000000
        75%        4.000000      70.000000
        max       24.000000      94.000000
2nd     count      6.000000       6.000000
        mean      15.500000      67.000000
        std       14.652645      14.057027
        min        2.000000      57.000000
        25%        2.250000      58.250000
        50%       13.500000      62.000000
        75%       29.250000      68.000000
        max       31.000000      94.000000

## Step 6. What is the mean each company's preTestScore?

In [10]:
{'1st': 6.6666667, '2nd':15.5}

{'1st': 6.6666667, '2nd': 15.5}

## Step 7. Present the mean preTestScores grouped by regiment and company

In [12]:
military_data.groupby(['company', 'regiment']).mean()

                    preTestScore  postTestScore
company regiment
1st     Dragoons             3.5           47.5
        Nighthawks          14.0           59.5
        Scouts               2.5           66.0
2nd     Dragoons            27.5           75.5
        Nighthawks          16.5           59.5
        Scouts               2.5           66.0

## Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [23]:
military_data.groupby(['company', 'regiment']).mean().reset_index()

  company    regiment  preTestScore  postTestScore
0     1st    Dragoons           3.5           47.5
1     1st  Nighthawks          14.0           59.5
2     1st      Scouts           2.5           66.0
3     2nd    Dragoons          27.5           75.5
4     2nd  Nighthawks          16.5           59.5
5     2nd      Scouts           2.5           66.0

## Step 9. Group the entire dataframe by regiment and company

In [26]:
military_data.set_index(['company', 'regiment']).sort_index(level='company')

                        name  preTestScore  postTestScore
company regiment
1st     Dragoons       Cooze             3             70
        Dragoons       Jacon             4             25
        Nighthawks    Miller             4             25
        Nighthawks  Jacobson            24             94
        Scouts         Sloan             2             62
        Scouts         Piger             3             70
2nd     Dragoons      Ryaner            24             94
        Dragoons        Sone            31             57
        Nighthawks       Ali            31             57
        Nighthawks    Milner             2             62
        Scouts         Riani             2             62
        Scouts           Ali             3             70

## Step 10. What is the number of observations in each regiment and company

In [29]:
military_data.groupby(['company', 'regiment']).count()['name']

company  regiment
1st      Dragoons      2
         Nighthawks    2
         Scouts        2
2nd      Dragoons      2
         Nighthawks    2
         Scouts        2
Name: name, dtype: int64

## Step 11. Iterate over a group and print the name and the whole data from the regiment
### for loops are okay for this one!!

In [52]:
grouped_military_data = military_data.groupby(['company', 'regiment'])
groups = grouped_military_data.groups
for group in groups:
    print(grouped_military_data.get_group(group)[['name','preTestScore','postTestScore']].to_string(index=False))

  name  preTestScore  postTestScore
 Cooze             3             70
 Jacon             4             25
     name  preTestScore  postTestScore
   Miller             4             25
 Jacobson            24             94
  name  preTestScore  postTestScore
 Sloan             2             62
 Piger             3             70
   name  preTestScore  postTestScore
 Ryaner            24             94
   Sone            31             57
   name  preTestScore  postTestScore
    Ali            31             57
 Milner             2             62
  name  preTestScore  postTestScore
 Riani             2             62
   Ali             3             70